#+TITLE: Steckemacs
#+AUTHOR: steckerhalter

#+OPTIONS: toc:nil num:nil

*** org-mode

#+BEGIN_SRC emacs-lisp
  ;; if todo.org exists, startup emacs with the org todo (list )
  (require 'org)
  (let ((todo "~/org/todo.org"))
    (when (file-readable-p todo)
      (setq org-agenda-files '("~/org/todo.org" "~/org/deft/"))
      (setq initial-buffer-choice (lambda ()
                                    (org-agenda nil "n")
                                    (delete-other-windows)
                                    (current-buffer)
                                    ))
      ))
  (add-to-list 'auto-mode-alist '("\\.org\\'" . org-mode))
  (setq org-startup-indented t)
  (setq org-refile-targets '((org-agenda-files :maxlevel . 3)))
  (setq org-startup-folded 'nofold)
  (setq org-src-fontify-natively t)
  (setq org-src-tab-acts-natively t)
  (setq org-confirm-babel-evaluate nil)
  (setq org-default-notes-file (concat org-directory "/todo.org"))
  (global-set-key (kbd "C-c C-9") 'org-capture)
  
  ;; minted
  (require 'ox-latex)
  (add-to-list 'org-latex-packages-alist '("" "minted"))
  (setq org-latex-listings 'minted)
  
  (setq org-latex-pdf-process
        '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
  
  (setq
   appt-display-mode-line t     ; show in the modeline
   appt-display-format 'window)
  (appt-activate 1)              ; activate appt (appointment notification)
  
  (org-agenda-to-appt)           ; add appointments on startup
  
  ;; add new appointments when saving the org buffer, use 'refresh argument to do it properly
  (add-hook 'org-mode-hook
            (lambda ()
              (add-hook 'after-save-hook '(lambda () (org-agenda-to-appt 'refresh)) nil 'make-it-local)
              (local-set-key "\C-cd" 'org-toodledo-mark-task-deleted)
              (local-set-key "\C-cs" 'org-toodledo-sync)
              ))
  (setq appt-disp-window-function '(lambda (min-to-app new-time msg) (interactive)
                                     (shell-command (concat "notify-send -i /usr/share/icons/gnome/32x32/status/appointment-soon.png '" (format "Appointment in %s min" min-to-app) "' '" msg "'")))
        )
  ;; add state to the sorting strategy of todo
  (setcdr (assq 'todo org-agenda-sorting-strategy) '(todo-state-up priority-down category-keep))
  ;; define todo states: set time stamps one waiting, delegated and done
  (setq org-todo-keywords
        '((sequence
           "TODO(t)"
           "REMINDER(r)"
           "WAITING(w!)"
           "DELEGATED(g!)"
           "SOMEDAY(s)"
           "|"
           "DONE(d!)"
           )))
  
  (global-set-key (kbd "C-c A") 'org-agenda)
  (global-set-key (kbd "C-c a") (lambda () (interactive) (org-agenda nil "n")))
#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (org-agenda nil n) |

